{
  "backend/main.mo": "Main Motoko actor for the Blackrays travel app, defining data types and APIs for tour packages, customer inquiries (car rental, custom package, railway, flight, hotel), user profiles, and admin operations with access control.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing their purpose and notable recent changes.",
  "frontend/DEPLOYMENT.md": "Documents the valid deployment slug `blackrays-car-rentals-tours`, lists invalid slug examples, and explains SPA routing support via a `_redirects` file.",
  "frontend/index.css": "Root CSS file that imports Tailwind directives and defines OKLCH-based CSS custom property color tokens for both light and dark themes.",
  "frontend/index.html": "HTML entry point for the Vite app, setting the page title to 'Blackrays Tours & Travel Agency' and mounting the React app at `#root`.",
  "frontend/public/_redirects": "Single redirect rule that serves `index.html` for all routes with a 200 status to enable SPA deep-link navigation on static hosting.",
  "frontend/public/404.html": "Fallback 404 HTML page that loads the built SPA assets so client-side routing handles unknown paths on static hosts.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all public and admin routes, wraps the app in QueryClient and ThemeProvider, and renders the Toaster.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard component that checks Internet Identity authentication and admin status, showing loading/error states or blocking access with a message if unauthorized.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component that triggers Internet Identity login or logout, clears the React Query cache on logout, and shows loading state during authentication.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog that appears for newly authenticated users with no profile, prompting them to enter and save their name via the backend profile API.",
  "frontend/src/components/flights/FlightResultCard.tsx": "Renders a single flight result card showing outbound/return segment details (times, airports, airline, stops, duration), fare, refundability status, and a booking button that opens a URL or calls an onBook callback.",
  "frontend/src/components/flights/FlightResultsList.tsx": "Displays a list of FlightResultCard components with conditional states for loading spinner, error message, no-results empty state, and a results header showing count sorted by price.",
  "frontend/src/components/flights/FlightSearchForm.tsx": "A flight search form with one-way/round-trip toggle, origin/destination inputs with swap button, date pickers, passenger count, and cabin class selector, with client-side validation before calling onSearch.",
  "frontend/src/components/home/HeroSearchWidget.tsx": "A tabbed hero search widget supporting flights, trains, car rentals, hotels, and packages, navigating to the appropriate route on search with hotel-specific destination and date inputs.",
  "frontend/src/components/home/HomeContactBar.tsx": "A top contact bar displaying the MD & Chairman name, a clickable phone number, and a clickable email address for Blackrays Travel Agency.",
  "frontend/src/components/layout/Footer.tsx": "Site-wide footer with brand info, contact details, and navigation columns for Services and Company links, rendered on a dark charcoal background.",
  "frontend/src/components/layout/Header.tsx": "Responsive site header with logo, desktop navigation (including a dropdown for Bookings), mobile menu toggle, and a LoginButton component.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wrapper layout component that renders the Header, a flexible main content area, and Footer around child content.",
  "frontend/src/components/packages/PackageCard.tsx": "Card component for displaying a tour package with title, description, price, duration, and a link to the package detail page.",
  "frontend/src/components/railway/RailwayResultCard.tsx": "Displays a single train search result with departure/arrival times, duration, available classes with fares, and a booking action button.",
  "frontend/src/components/railway/RailwayResultsList.tsx": "Renders the list of railway search results, handling loading, error, empty, and populated states using RailwayResultCard.",
  "frontend/src/components/railway/RailwaySearchForm.tsx": "Form component for searching train routes with origin/destination stations, travel date, passenger count, and class selection, including swap and validation logic.",
  "frontend/src/config/deployment.ts": "Defines and validates the deployment slug 'blackrays-car-rentals-tours', enforcing platform naming rules at module load time.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useFlightSearch.ts": "Custom hook managing flight search state and data fetching via React Query, exposing search/reset functions and query status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an `InternetIdentityProvider` component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including user profile management, admin checks, public packages, and form submissions for tour inquiries, car rentals, and custom packages. Each mutation invalidates relevant query caches on success.",
  "frontend/src/hooks/useRailwaySearch.ts": "Custom hook that wraps a React Query `useQuery` call to search for trains via `railwayApi`, managing search parameters in local state and exposing search/reset functions along with results and loading state.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind directives, and defines a comprehensive CSS custom property design system with light/dark theme tokens for colors, spacing, and reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider` into the root DOM element.",
  "frontend/src/pages/AboutPage.tsx": "Static About page displaying company values, leadership information for the MD & Chairman, and contact details using a hero section, grid layout, and icon-based value cards.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard landing page with navigation cards linking to package management and inquiries sections.",
  "frontend/src/pages/admin/AdminInquiriesPage.tsx": "Admin page that lists all customer inquiries with category icons, status badges, and inline status update controls using a select dropdown per inquiry card.",
  "frontend/src/pages/admin/AdminPackagesPage.tsx": "Admin page for managing tour packages with full CRUD operations (create, edit, delete) using dialogs and React Query mutations, with toast notifications for feedback.",
  "frontend/src/pages/CarRentalsPage.tsx": "Car rental booking page that lets users select a vehicle type (Sedan/SUV), pricing mode (per km or per day), driver option, and submit a rental inquiry form with live fare estimation. Shows a success screen after successful submission.",
  "frontend/src/pages/ContactInquiryPage.tsx": "A contact page with a hero section, contact info cards (phone, email, address), and a form that submits tour inquiries via the `useSubmitTourInquiry` hook, showing a success state after submission.",
  "frontend/src/pages/CustomPackagesPage.tsx": "A custom travel package request page where users select India or Abroad, fill in trip details (destination, travelers, duration, dates), and submit via `useSubmitCustomPackage`, with feature highlights and a success state.",
  "frontend/src/pages/FlightBookingsPage.tsx": "A flight bookings page with a live flight search form and results list, plus a collapsible inquiry form that submits booking requests via `useSubmitFlightBooking`; auto-searches if URL query params are present.",
  "frontend/src/pages/HomePage.tsx": "The main landing page displaying a hero section with a search widget, featured destinations, service cards (tours, car rentals, flights, railway, hotels), car pricing, and a features/trust section.",
  "frontend/src/pages/HotelBookingsPage.tsx": "A hotel bookings page that generates mock hotel results based on destination and room type inputs, displays them as star-rated cards, and allows users to submit a booking inquiry via `useSubmitHotelBooking`.",
  "frontend/src/pages/PackageDetailsPage.tsx": "Displays detailed information for a single tour package fetched by ID, including title, duration, price, description, and a booking card with a contact link. Handles loading, error, and not-found states.",
  "frontend/src/pages/PackagesPage.tsx": "Lists all public tour packages in a responsive grid using PackageCard components, with loading, error, and empty-state handling.",
  "frontend/src/pages/RailwayBookingsPage.tsx": "Provides a railway ticket booking request form with fields for passenger details, origin/destination stations, travel date, passenger count, and rail class, submitting via a mutation hook.",
  "frontend/src/pages/TermsPage.tsx": "Renders a static Terms & Conditions page with nine predefined sections covering booking, cancellation, rental, liability, and privacy policies.",
  "frontend/src/services/flightApi.ts": "Flight search and booking service that currently uses mock data (Indian airlines, airport codes, fare generation) with documented hooks for integrating real APIs like Amadeus or RapidAPI.",
  "frontend/src/services/railwayApi.ts": "Railway/train search service using mock data for Indian trains, stations, and seat classes, with documented options for connecting to real IRCTC or RapidAPI railway APIs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and a function to clean sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a warm/premium color palette, custom fonts (Outfit, Inter), extended border radii, box shadows, and background images, with animate, typography, and container-queries plugins.",
  "project_state.json": "Project state manifest (version 27) describing the Blackrays Car Rentals & Tours platform goals, architectural notes, known issues (API credentials, email/SMS), and a list of all implemented features."
}