{
  "backend/main.mo": "Main actor for the Blackrays travel app backend, defining data types and public APIs for tour packages, customer inquiries (car rental, custom package, railway, flight, hotel), user profiles, and admin operations with role-based access control.",
  "backend/migration.mo": "Data migration module that upgrades stored CustomerInquiry records by adding `pricingMode` and `estimatedDays` fields to CarRentalDetails, defaulting both to null for existing records.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs and titles to their relevant source files, components, and test IDs for car rental pricing modes, booking form updates, and T&C checkbox requirements.",
  "frontend-file-summaries.txt": "Auto-generated text file containing one-line summaries of each frontend source file, describing their purpose and notable recent changes.",
  "frontend/DEPLOYMENT.md": "Documents the valid deployment slug (`blackrays-car-rentals-tours`), lists invalid slug examples, and explains SPA routing support via the `_redirects` file and deployment config.",
  "frontend/index.css": "Root CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for the light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title to 'Blackrays Tours & Travel Agency' and mounting the React root at `#root`.",
  "frontend/public/_redirects": "Static hosting redirect rule that serves `index.html` for all routes with a 200 status, enabling TanStack Router SPA navigation.",
  "frontend/public/404.html": "Fallback 404 page that loads the compiled SPA assets so client-side routing works correctly on direct URL access for static hosting.",
  "frontend/src/App.tsx": "Defines the React app with TanStack Router, React Query, and theme provider, registering all public and admin routes wrapped in a shared SiteLayout.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard component that checks Internet Identity authentication and admin status, rendering children only if the caller is a verified admin.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing appropriate icons and loading state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog that prompts newly authenticated users to enter their name and save a profile if none exists yet.",
  "frontend/src/components/flights/FlightResultCard.tsx": "Card component displaying a single flight result with outbound/return segments, fare, refundability badge, and a booking action button.",
  "frontend/src/components/flights/FlightResultsList.tsx": "Renders a list of FlightResultCard components with loading, error, and empty-state handling based on search status.",
  "frontend/src/components/flights/FlightSearchForm.tsx": "Form component for searching flights with fields for trip type, origin, destination, dates, passengers, and cabin class, including client-side validation.",
  "frontend/src/components/home/HeroSearchWidget.tsx": "A tabbed search widget for the home page hero section supporting flights, trains, car rentals, hotels, and packages, navigating to the appropriate route on search.",
  "frontend/src/components/home/HomeContactBar.tsx": "A contact bar component displaying the MD & Chairman's name, phone number, and email address for Blackrays Travel Agency.",
  "frontend/src/components/layout/Footer.tsx": "Site-wide footer with brand info, contact details, and navigation links for services, company pages, and legal pages.",
  "frontend/src/components/layout/Header.tsx": "Sticky site header with logo, desktop navigation (including a Bookings dropdown), mobile menu toggle, and a login button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wrapper layout component that composes the Header, main content area, and Footer into a full-page flex column.",
  "frontend/src/components/packages/PackageCard.tsx": "A card component for displaying a tour package's title, description, price, and duration with a link to the package detail page.",
  "frontend/src/components/railway/RailwayResultCard.tsx": "A card component for displaying a train search result including train name, times, duration, available classes with fares, and a booking action button.",
  "frontend/src/components/railway/RailwayResultsList.tsx": "Renders a list of train search results with distinct UI states for loading, error, no results, and a populated results list using RailwayResultCard components.",
  "frontend/src/components/railway/RailwaySearchForm.tsx": "A form component for searching trains by origin/destination station, date, passengers, and rail class, with validation and a swap-stations button.",
  "frontend/src/config/deployment.ts": "Defines and validates the deployment slug 'blackrays-car-rentals-tours', enforcing format rules and ensuring it contains 'blackrays' and is not in a known invalid slugs list.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useFlightSearch.ts": "Custom hook that manages flight search state and triggers a React Query fetch via the flight API, exposing results, loading/error states, and search/reset functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for backend actor calls, covering user profiles, admin checks, tour packages, inquiries, car rentals, and custom packages with appropriate cache invalidation.",
  "frontend/src/hooks/useRailwaySearch.ts": "Custom hook that manages railway train search state and triggers a React Query fetch via the railway API, exposing results, loading/error states, and search/reset functions.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Outfit, Inter), sets up Tailwind directives, and defines CSS custom properties for light/dark themes including colors, typography, and reusable component utility classes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AboutPage.tsx": "Static About page displaying Blackrays' company values, leadership profile (MD & Chairman Om H Patil), and contact information with a dark hero section and warm-themed layout.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard landing page with navigation cards linking to the Manage Packages and View Inquiries sections.",
  "frontend/src/pages/admin/AdminInquiriesPage.tsx": "Admin page that fetches and displays all customer inquiries as cards, allowing admins to view inquiry details and update each inquiry's status via a dropdown.",
  "frontend/src/pages/admin/AdminPackagesPage.tsx": "Admin page for managing tour packages, providing UI to create, edit, and delete packages via dialogs with form validation and toast notifications.",
  "frontend/src/pages/CarRentalsPage.tsx": "Car rental booking page allowing users to select a vehicle type (Sedan/SUV), pricing mode (per km or per day), driver option, and submit contact details; includes live fare estimation and calls the useSubmitCarRental mutation.",
  "frontend/src/pages/ContactInquiryPage.tsx": "Contact page with a general inquiry form (name, phone, email, message) that submits via useSubmitTourInquiry, alongside static contact info cards for phone, email, and office location.",
  "frontend/src/pages/CustomPackagesPage.tsx": "Custom travel package request page where users specify destination type (India/Abroad), destination, traveler count, duration, and preferred dates, submitting the form via useSubmitCustomPackage with toast notifications.",
  "frontend/src/pages/FlightBookingsPage.tsx": "Page for searching and booking flights, featuring a search form with auto-search from URL params, live flight results list, and a collapsible inquiry form that submits booking requests via a mutation hook.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying a hero section with a search widget, services overview, featured destinations, car pricing, and trust/feature highlights using static data and navigation links.",
  "frontend/src/pages/HotelBookingsPage.tsx": "Hotel search and booking page that generates mock hotel results based on destination and room type inputs, and allows users to submit hotel booking inquiries via a mutation hook.",
  "frontend/src/pages/PackageDetailsPage.tsx": "Detail page for a single tour package, fetching package data by ID from a public packages query and displaying duration, price, description, and a booking card with a contact link.",
  "frontend/src/pages/PackagesPage.tsx": "Tour packages listing page that fetches and displays all public packages in a grid using PackageCard components, with loading, error, and empty-state handling.",
  "frontend/src/pages/RailwayBookingsPage.tsx": "Railway ticket booking page with a form for submitting train booking inquiries (origin, destination, date, class, passengers) via a mutation hook, plus a hero section and feature highlights.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms & Conditions page for Blackrays Car Rentals, displaying a hero section and a list of legal sections covering booking, cancellation, rental terms, privacy, and liability.",
  "frontend/src/services/flightApi.ts": "Defines TypeScript interfaces and a mock data generator for flight search, simulating results with Indian airlines and airport codes until a real API (e.g., Amadeus) is integrated.",
  "frontend/src/services/railwayApi.ts": "Defines TypeScript interfaces and a mock data generator for Indian railway train search, simulating train results with station codes, seat classes, and fares until a real IRCTC/RapidAPI integration is added.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Outfit, Inter), an extended warm/premium color palette, border radii, box shadows, background images, and plugin registrations.",
  "project_state.json": "Project state manifest (version 25) describing the Blackrays Car Rentals & Tours platform goals, architectural notes, known issues, and a list of existing implemented features."
}