{
  "backend/main.mo": "Main actor for the Blackrays travel backend, defining tour packages, customer inquiries (car rental, custom package, railway, flight, hotel), user profile management, and admin APIs with access control.",
  "backend/migration.mo": "Data migration module that upgrades old actor state by adding the new `hotelBookingDetails` field and `#hotelBooking` inquiry category to existing customer inquiry records.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (car rental pricing update, hotel bookings page, homepage hotel card) to their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated summaries of all frontend source files, describing each component's purpose, recent changes, and styling decisions for build planning reference.",
  "frontend/DEPLOYMENT.md": "Documents the valid deployment slug (`blackrays-car-rentals-tours`), invalid slug examples, and SPA routing support configuration via `_redirects` and `deployment.ts`.",
  "frontend/index.css": "Root Tailwind CSS entry point defining OKLCH-based monochrome design tokens for light and dark themes used across the application.",
  "frontend/index.html": "HTML entry point for the Vite/React SPA, setting the page title to 'Blackrays Tours & Travel Agency' and mounting the app at `#root`.",
  "frontend/public/_redirects": "Netlify/static host redirect rule that serves `index.html` for all routes with a 200 status to enable SPA client-side navigation.",
  "frontend/public/404.html": "Static 404 fallback page that loads the built SPA assets so client-side routing works on direct URL access for static hosting.",
  "frontend/src/App.tsx": "Defines the React app with TanStack Router, React Query, and theme provider, setting up all public and admin routes wrapped in a shared SiteLayout.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard component that checks Internet Identity authentication and admin status, rendering children only if the user is a verified admin.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing appropriate icons and loading state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog that prompts newly authenticated users to enter their name and save a profile if none exists yet.",
  "frontend/src/components/flights/FlightResultCard.tsx": "Card component that displays a single flight result including outbound/return segments, fare, refundability, and a booking button.",
  "frontend/src/components/flights/FlightResultsList.tsx": "Renders a list of FlightResultCards with loading, error, and empty-state handling based on search status.",
  "frontend/src/components/flights/FlightSearchForm.tsx": "Form component for searching flights with fields for trip type, origin, destination, dates, passengers, and cabin class, including validation.",
  "frontend/src/components/home/HeroSearchWidget.tsx": "A tabbed search widget for the home page hero section supporting flights, trains, car rentals, hotels, and packages, navigating to the appropriate route on search.",
  "frontend/src/components/home/HomeContactBar.tsx": "A contact bar component displaying the MD & Chairman name, phone number, and email address for Blackrays Travel Agency.",
  "frontend/src/components/layout/Footer.tsx": "Site-wide footer with brand info, contact details, and navigation links for services, company pages, and legal pages.",
  "frontend/src/components/layout/Header.tsx": "Sticky site header with logo, desktop navigation (including a Bookings dropdown), mobile menu toggle, and a login button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wrapper layout component that composes the Header, main content area, and Footer into a full-page flex column.",
  "frontend/src/components/packages/PackageCard.tsx": "A card component for displaying a tour package with title, description, price, and duration, linking to the package detail page.",
  "frontend/src/components/railway/RailwayResultCard.tsx": "A card component for displaying a train search result with departure/arrival times, duration, available classes with fares, and a booking action.",
  "frontend/src/components/railway/RailwayResultsList.tsx": "Renders the railway search results list, handling loading, error, empty, and populated states by mapping TrainResult items to RailwayResultCard components.",
  "frontend/src/components/railway/RailwaySearchForm.tsx": "A form component for searching trains with fields for origin/destination stations, travel date, passengers, and rail class, including validation and a swap-stations button.",
  "frontend/src/config/deployment.ts": "Defines and validates the deployment slug 'blackrays-car-rentals-tours', enforcing format rules and ensuring it contains 'blackrays' while documenting known invalid slugs.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, initializing it with an authenticated or anonymous identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useFlightSearch.ts": "Custom hook managing flight search state and queries via React Query, exposing search/reset functions and returning results, loading, and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flows, identity persistence, and login status states.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, admin checks, tour packages, inquiries, car rentals, and custom packages with appropriate cache invalidation.",
  "frontend/src/hooks/useRailwaySearch.ts": "Custom hook managing railway train search state and queries via React Query, exposing search/reset functions and returning results, loading, and error states.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Outfit, Inter), sets up Tailwind directives, and defines CSS custom properties for light/dark themes including colors, typography, and reusable component utility classes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AboutPage.tsx": "Static About page displaying company values, leadership bio for the MD & Chairman, and contact information for Blackrays travel agency.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard landing page with navigation cards linking to package management and inquiry management sections.",
  "frontend/src/pages/admin/AdminInquiriesPage.tsx": "Displays all customer inquiries fetched via React Query, allowing admins to view inquiry details by category and update each inquiry's status (New, In Progress, Resolved).",
  "frontend/src/pages/admin/AdminPackagesPage.tsx": "Admin page for managing tour packages, supporting create, edit, and delete operations via dialogs and confirmation prompts using React Query mutations.",
  "frontend/src/pages/CarRentalsPage.tsx": "Car rentals page allowing users to select a vehicle type (Sedan/SUV), toggle driver requirement, enter distance for fare estimation, and submit a rental inquiry via the useSubmitCarRental hook.",
  "frontend/src/pages/ContactInquiryPage.tsx": "Contact page with a form that submits general inquiries via useSubmitTourInquiry, alongside static contact details (phone, email, office location).",
  "frontend/src/pages/CustomPackagesPage.tsx": "Custom travel packages page where users specify destination type, traveler count, duration, and preferred dates, then submit a package request via useSubmitCustomPackage with toast notifications for validation and feedback.",
  "frontend/src/pages/FlightBookingsPage.tsx": "Flight booking page with a live search form, results list, and a collapsible inquiry form that submits booking requests via a mutation hook. Auto-triggers a search when URL query params (origin, destination, date) are present.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying a hero section with a search widget, services overview, featured destinations, car pricing, and trust features. Uses static data arrays and links to other booking pages.",
  "frontend/src/pages/HotelBookingsPage.tsx": "Hotel booking page with a search form that generates mock hotel results based on destination and room type, plus a booking inquiry form that submits via a mutation hook. Includes star rating and hotel result card sub-components.",
  "frontend/src/pages/PackageDetailsPage.tsx": "Detail view for a single tour package, fetched by ID from the public packages query. Displays duration, price, description, and a sticky booking card with a contact link.",
  "frontend/src/pages/PackagesPage.tsx": "Lists all public tour packages in a responsive grid using data from the useGetPublicPackages hook. Handles loading, error, and empty states with appropriate UI feedback.",
  "frontend/src/pages/RailwayBookingsPage.tsx": "Railway ticket booking page with a form for passenger details, stations, travel date, and rail class. Submits the booking request via a mutation hook and shows a success state on completion.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms & Conditions page for Blackrays Car Rentals, displaying a hero section and a list of legal sections covering booking, cancellation, liability, and privacy policies.",
  "frontend/src/services/flightApi.ts": "Defines TypeScript interfaces and a mock data generator for flight search, simulating results from Indian airlines with placeholder logic intended to be replaced by a real API such as Amadeus or RapidAPI.",
  "frontend/src/services/railwayApi.ts": "Defines TypeScript interfaces and a mock data generator for Indian railway train search, simulating train results with seat classes and schedules, intended to be replaced by a real IRCTC or RapidAPI integration.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Outfit, Inter), an extended warm/premium color palette, border radii, box shadows, background images, and required plugins.",
  "project_state.json": "Project state manifest (version 23) describing the Blackrays Car Rentals & Tours platform goals, architectural notes, known issues, existing features, and image requirements for build planning."
}