{
  "backend/main.mo": "Main Motoko actor for the Blackrays travel app backend, defining data types and APIs for tour packages, customer inquiries (car rental, custom package, railway, flight, hotel), user profiles, and access-controlled admin operations.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their affected files, components, test IDs, and confidence levels for tracking address fixes, homepage copy refinements, and visual design overhauls.",
  "frontend-file-summaries.txt": "A JSON document containing one-line summaries of every frontend source file, serving as a reference index for the project's frontend codebase structure and recent changes.",
  "frontend/DEPLOYMENT.md": "Documents the valid deployment slug `blackrays-car-rentals-tours`, lists invalid slug examples, and explains SPA routing support via the `_redirects` file and deployment config.",
  "frontend/index.css": "Root CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom property tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title to 'Blackrays Tours & Travel Agency' and mounting the React root div with the main module script.",
  "frontend/public/_redirects": "Single-rule redirect configuration for static hosting that serves `index.html` for all routes with a 200 status to support TanStack Router client-side navigation.",
  "frontend/public/404.html": "Static 404 fallback page that loads the built app assets so the SPA can handle routing even on direct 404 responses from the server.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all public and admin routes, wraps the app in QueryClient and ThemeProvider, and applies AdminRouteGuard to protected admin pages.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard component that checks Internet Identity authentication and admin status, rendering loading/access-denied states or the protected children accordingly.",
  "frontend/src/components/auth/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing loading state during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "A modal dialog that appears after login when no user profile exists, prompting the user to enter their name and save it via a mutation.",
  "frontend/src/components/flights/FlightResultCard.tsx": "Displays a single flight result with airline, route, timing, price, and a 'Book Now' button that triggers the provided callback.",
  "frontend/src/components/flights/FlightResultsList.tsx": "Renders a list of flight result cards with distinct states for loading, error, no results, and successful results sorted by price.",
  "frontend/src/components/flights/FlightSearchForm.tsx": "A flight search form with autocomplete airport inputs, trip type selection, passenger count, cabin class, and date pickers that calls an onSearch callback with the selected parameters.",
  "frontend/src/components/home/HeroSearchWidget.tsx": "A tabbed search widget on the home page for Cars, Flights, Hotels, Trains, and Packages that navigates to the corresponding route on search.",
  "frontend/src/components/home/HomeContactBar.tsx": "A top contact bar displaying the MD's name, phone number, email, and location for the Blackrays travel agency.",
  "frontend/src/components/layout/Footer.tsx": "A multi-column site footer with brand info, contact details, and navigation links for services and company pages.",
  "frontend/src/components/layout/Header.tsx": "Responsive site header with logo, desktop navigation (including a dropdown for Bookings), mobile menu toggle, and a login button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wrapper layout component that renders the Header, a main content area, and Footer around child components.",
  "frontend/src/components/packages/PackageCard.tsx": "Card component for displaying a tour package with title, description, price, duration, and a link to the package detail page.",
  "frontend/src/components/railway/RailwayResultCard.tsx": "Displays a single train search result with departure/arrival times, duration, available classes with fares, and a booking action button.",
  "frontend/src/components/railway/RailwayResultsList.tsx": "Renders the list of train search results with loading, error, and empty-state UI, delegating each result to RailwayResultCard.",
  "frontend/src/components/railway/RailwaySearchForm.tsx": "Form component for searching trains by origin/destination station, travel date, passenger count, and rail class, with validation and station-swap functionality.",
  "frontend/src/config/deployment.ts": "Defines and validates the deployment slug ('blackrays-car-rentals-tours') for platform-managed hosting, enforcing naming rules at module load time.",
  "frontend/src/data/airports.ts": "Static dataset of airports (name, city, country, IATA code) covering India and international locations for use in flight search features.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useFlightSearch.ts": "React hook that manages flight search state (results, loading, error) by calling the flightApi service, with search and reset functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider for React, exposing login/logout functions, identity state, and login status via a custom hook backed by DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend interactions including user profiles, admin checks, tour packages, inquiries, car rentals, and custom packages using the ICP actor.",
  "frontend/src/hooks/useRailwaySearch.ts": "React hook that manages railway train search state using React Query, triggering searches when params are set and exposing results, loading, and error state.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, defines CSS custom properties for light/dark themes, and declares reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Static About page component displaying company values, leadership information for the MD & Chairman, and contact details for Blackrays travel agency.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard landing page displaying navigation cards linking to package management and inquiries sections, with a welcome banner.",
  "frontend/src/pages/admin/AdminInquiriesPage.tsx": "Admin page that lists all customer inquiries with category icons, status badges, and a per-card status update dropdown. Uses React Query hooks to fetch and mutate inquiry data, showing toast notifications on success or failure.",
  "frontend/src/pages/admin/AdminPackagesPage.tsx": "Admin page for managing tour packages with create, edit, and delete functionality via dialogs and alert dialogs. Uses React Query hooks for CRUD operations and displays toast notifications for each action.",
  "frontend/src/pages/CarRentalsPage.tsx": "Car rental booking page that lets users select a vehicle type (Sedan/SUV), pricing mode (per km or per day), driver preference, and submit contact details. Includes live fare estimation and a post-submission success screen.",
  "frontend/src/pages/ContactInquiryPage.tsx": "Contact/inquiry page with a hero section, contact info cards (phone, email, address), and a form that submits tour inquiries via the useSubmitTourInquiry hook.",
  "frontend/src/pages/CustomPackagesPage.tsx": "Custom travel package request page where users specify destination type (India/Abroad), destination, traveler count, duration, and preferred dates, then submit via useSubmitCustomPackage.",
  "frontend/src/pages/FlightBookingsPage.tsx": "Flight booking page featuring a live flight search form with results list, direct booking links, and a collapsible manual inquiry form that submits via useSubmitFlightBooking.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying a hero section with a search widget, a services grid (car rentals, flights, hotels, etc.), feature highlights, and popular destinations.",
  "frontend/src/pages/HotelBookingsPage.tsx": "Hotel booking page that generates mock hotel results based on destination and room type, displays them in cards, and submits booking requests via a mutation hook with toast notifications.",
  "frontend/src/pages/PackageDetailsPage.tsx": "Detail page for a single tour package, fetching it by ID from public packages data and displaying duration, price, description, and a booking card with error/loading/not-found states.",
  "frontend/src/pages/PackagesPage.tsx": "Public listing page that fetches and displays all tour packages in a responsive grid, with loading, error, and empty-state handling.",
  "frontend/src/pages/RailwayBookingsPage.tsx": "Railway ticket booking page with a form for train details and passenger info that submits a booking request via a mutation hook, showing a success state and toast notifications.",
  "frontend/src/pages/TermsPage.tsx": "Static Terms & Conditions page that renders a list of policy sections (booking, cancellation, liability, etc.) with a dark hero header.",
  "frontend/src/services/flightApi.ts": "Defines a flight search service with a mock implementation that generates random flight results simulating airline, timing, price, and stops data. Includes commented-out placeholders for integrating real Amadeus or Skyscanner APIs.",
  "frontend/src/services/hotelApi.ts": "Defines a hotel search service with a mock implementation that generates random hotel results with names, star ratings, amenities, and pricing. Includes commented-out placeholders for integrating real RapidAPI Hotels or Booking.com APIs.",
  "frontend/src/services/railwayApi.ts": "Defines a train search service with mock data generation for Indian railway routes, including train names, seat classes, fares, and departure times. Includes station code mappings and comments for integrating real IRCTC or RapidAPI railway APIs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (mapped to CSS variables), fonts, border radii, shadows, gradients, animations, and plugins for a premium travel platform UI.",
  "project_state.json": "Project state manifest describing the Blackrays Car Rentals & Tours platform goals, architecture notes, known issues, existing features, and versioning metadata at state version 31."
}