{
  "backend/main.mo": "Main actor for the Blackrays travel backend, defining data types (TourPackage, CustomerInquiry, CarRentalDetails, etc.) and public/admin APIs for managing packages, inquiries, and user profiles with role-based access control.",
  "backend/migration.mo": "Migration module that transforms old actor state (with limited inquiry categories and car rental details) to the new schema supporting custom packages, railway bookings, flight bookings, and extended car rental fields.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (custom travel packages page, car rental per-km pricing, hero image replacement, T&C notice, etc.) to their associated source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON document providing one-line summaries of each frontend source file, serving as a quick reference for the project's frontend structure and component responsibilities.",
  "frontend/DEPLOYMENT.md": "Documents the valid deployment slug ('blackrays-car-rentals-tours'), invalid slug examples, where the slug is configured, and SPA routing support setup for static hosting.",
  "frontend/index.css": "Root CSS file importing Tailwind layers and defining OKLCH-based CSS custom properties for a monochrome light/dark color system used throughout the app.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title to 'Blackrays Tours & Travel Agency' and mounting the React root.",
  "frontend/public/_redirects": "Netlify/static host redirect rule that serves index.html for all paths, enabling TanStack Router SPA navigation on direct URL access.",
  "frontend/public/404.html": "Static 404 fallback page that loads the compiled SPA assets, enabling client-side routing to handle the route after load.",
  "frontend/src/App.tsx": "Defines the React app with TanStack Router, React Query, and theme provider, registering all public and admin routes under a shared SiteLayout.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin routes by checking Internet Identity authentication and admin status, rendering an access-denied or loading state when appropriate.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity, handling authentication state and clearing the React Query cache on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a modal dialog prompting newly authenticated users to enter their name and save a profile if none exists yet.",
  "frontend/src/components/home/HomeContactBar.tsx": "Displays a top contact bar with the agency's phone number, email, and MD name as clickable links.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with brand info, quick navigation links, booking links, and contact details.",
  "frontend/src/components/layout/Header.tsx": "Sticky site header with logo, desktop navigation, a bookings dropdown menu, mobile menu toggle, and a login button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps page content with the shared Header and Footer in a full-height flex column layout.",
  "frontend/src/components/packages/PackageCard.tsx": "Displays a tour package card showing title, description, duration, price, and a link to the package details page.",
  "frontend/src/config/deployment.ts": "Exports and validates the deployment slug 'blackrays-car-rentals-tours', enforcing naming rules and logging errors for invalid configurations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider component, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile management, admin checks, fetching public packages, and submitting tour inquiries, car rentals, and custom packages.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS, and defines CSS custom properties for light and dark theme design tokens including colors, radius, and typography.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Static About page displaying the company story, core values, and a founder quote for Blackrays Car Rentals & Tours and Travels.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "The admin dashboard landing page that greets the logged-in admin by name and provides navigation cards linking to the Tour Packages and Customer Inquiries management pages.",
  "frontend/src/pages/admin/AdminInquiriesPage.tsx": "An admin page that lists all customer inquiries (car rental and tour) fetched via useGetAllInquiries, displaying contact details and allowing status updates (New, In Progress, Resolved) per inquiry card.",
  "frontend/src/pages/admin/AdminPackagesPage.tsx": "An admin page for managing tour packages with full CRUD support—listing packages and providing dialogs for creating, editing, and deleting packages using the corresponding query hooks.",
  "frontend/src/pages/CarRentalsPage.tsx": "Car rentals page allowing users to select a vehicle type (Sedan/SUV), optionally estimate distance and fare, and submit a booking inquiry via the backend mutation hook.",
  "frontend/src/pages/ContactInquiryPage.tsx": "Contact page with a hero section, contact info (phone, email, address, hours), and a form that submits tour inquiries via the useSubmitTourInquiry hook with toast feedback.",
  "frontend/src/pages/CustomPackagesPage.tsx": "Custom travel packages page with a hero, feature highlights, and a form for submitting personalized trip requests (India or Abroad) including destination, travelers, duration, and preferred dates.",
  "frontend/src/pages/FlightBookingsPage.tsx": "Flight bookings page with a hero, feature cards, and a form for submitting flight booking requests supporting one-way/round-trip, cabin class selection, and passenger count via useSubmitFlightBooking.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying a hero section, services overview (packages, car rentals, train/flight bookings), vehicle options, feature highlights, and a live packages grid fetched via useGetPublicPackages.",
  "frontend/src/pages/PackageDetailsPage.tsx": "Detail page for a single tour package, fetching all packages via useGetPublicPackages and finding the matching one by ID, displaying title, duration, price, description, and a booking CTA card.",
  "frontend/src/pages/PackagesPage.tsx": "Tour packages listing page that fetches and displays all public packages in a grid using PackageCard, with loading/error/empty states and a CTA to request a custom package.",
  "frontend/src/pages/RailwayBookingsPage.tsx": "A page that renders a railway ticket booking form allowing users to submit travel details (origin, destination, date, class, passenger count) via the useSubmitRailwayBooking hook, with a hero section and feature highlights.",
  "frontend/src/pages/TermsPage.tsx": "A terms and conditions page displaying policy sections (self-drive liability, booking, vehicle usage, payment, cancellation) with icons and structured content using Lucide icons and TanStack Router links.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support for values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining dark mode, custom fonts (Outfit, Inter), CSS-variable-based color tokens, border radii, premium box shadows, and accordion/fade-in animations with the tailwindcss-animate and typography plugins.",
  "project_state.json": "Project state manifest (version 15) describing the Blackrays Car Rentals & Tours app goals, architecture notes, known issues, image requirements, and a full list of existing and planned frontend/backend features with their requirement IDs and versions."
}