{
  "kind": "build_request",
  "title": "Move SUV 'Most Popular' badge, add business address, premium homepage redesign, and direct booking UI for flights/trains/hotels",
  "projectName": "Blackrays Car Rentals & Tours",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "On the Car Rentals page, move the 'Most Popular' badge from the Sedan vehicle card to the SUV vehicle card. The Sedan card should no longer display any 'Most Popular' badge.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make suv segment more popular",
          "SUV gets the 'Most Popular' badge (moved from Sedan)"
        ]
      },
      "acceptanceCriteria": [
        "The SUV vehicle card displays a 'Most Popular' badge prominently.",
        "The Sedan vehicle card does not display a 'Most Popular' badge.",
        "All other vehicle card content (pricing, description, features) remains unchanged."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Add the business address 'Dhule, Maharashtra 424001' to the site footer alongside existing contact details, and to the Contact/Inquiry page's contact information section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "business address is dhule Maharashtra 424001",
          "Business address added: Dhule, Maharashtra 424001 (footer + contact sections)"
        ]
      },
      "acceptanceCriteria": [
        "The footer displays 'Dhule, Maharashtra 424001' as the business address.",
        "The Contact/Inquiry page displays 'Dhule, Maharashtra 424001' in the contact info section.",
        "The address appears consistently formatted alongside the phone, email, and MD & Chairman details."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Overhaul the homepage starting interface (hero section, search widget, service cards, and contact bar) with a more unique, premium, and user-friendly visual design. Apply richer visual hierarchy, updated hero treatment with improved typography and layout flow, polished micro-details, and ensure no box shadows are present. The redesign must remain consistent with the existing black/white/grey premium palette and the expanded beige/warm neutral tones already in the design system.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "change starting interface and make it look more unique premium and used friendly",
          "New unique, premium starting interface with refreshed hero treatment",
          "All service tabs (Flights, Trains, Hotels, Car Rentals, Tour Packages) in the search widget",
          "Polished visual hierarchy, layout flow, and micro-details"
        ]
      },
      "acceptanceCriteria": [
        "The homepage hero section has a visually distinct, premium look that differs meaningfully from the previous version.",
        "The HeroSearchWidget includes tabs for Flights, Trains, Hotels, Car Rentals, and Tour Packages.",
        "No box shadows are present on any element in the initial viewport.",
        "Service cards for all offerings (Flights, Trains, Car Rentals, Hotels, Custom Packages, Tour Packages, Railway Bookings) are displayed with clear descriptions and CTA buttons.",
        "The layout is fully responsive on mobile and desktop.",
        "The design remains consistent with the black/white/grey/beige premium palette."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Rebuild the Flight Ticket Bookings page (FlightBookingsPage.tsx) to feature a prominent live search UI with flight result cards showing airline name, departure/arrival times, duration, number of stops, cabin class, and fare. Use the existing mock flight API service (flightApi.ts) as the data source with clearly marked placeholders for real Amadeus API credentials. Users should be able to search flights and see results in a clean card list, then initiate a booking action (CTA that links to the inquiry form or an external booking URL placeholder). Handle loading, empty, and error states gracefully.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "add api so users can directly book flights",
          "Flights — Live search UI with airline/time/price cards; Amadeus API credential placeholders"
        ]
      },
      "acceptanceCriteria": [
        "The Flight Bookings page displays a search form with origin, destination, date, passengers, and cabin class fields.",
        "After searching, flight result cards are displayed showing airline, departure/arrival times, duration, stops, and price.",
        "A 'Book Now' or equivalent CTA is present on each result card.",
        "Loading, empty, and error states are handled with appropriate UI feedback.",
        "API credential placeholders are clearly marked in the service file with comments indicating where real Amadeus credentials go.",
        "The page is responsive on mobile and desktop."
      ]
    },
    {
      "id": "REQ-46",
      "text": "Rebuild the Railway Ticket Bookings page (RailwayBookingsPage.tsx) to feature a prominent live search UI with train result cards showing train name/number, departure/arrival times, duration, available classes with fares, and a booking action CTA. Use the existing mock railway API service (railwayApi.ts) as the data source with clearly marked placeholders for real RapidAPI/IRCTC credentials. Handle loading, empty, and error states gracefully.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "users can directly book flights and railways tickets",
          "Trains — Live search UI with train name/class/fare display; RapidAPI train search placeholders"
        ]
      },
      "acceptanceCriteria": [
        "The Railway Bookings page displays a search form with origin station, destination station, date, class, and passenger count fields.",
        "After searching, train result cards are displayed showing train name/number, departure/arrival times, duration, available classes, and fares.",
        "A 'Book Now' or equivalent CTA is present on each result card.",
        "Loading, empty, and error states are handled with appropriate UI feedback.",
        "API credential placeholders are clearly marked in the service file with comments indicating where real RapidAPI/IRCTC credentials go.",
        "The page is responsive on mobile and desktop."
      ]
    },
    {
      "id": "REQ-47",
      "text": "Rebuild the Hotel & Hospitality Bookings page (HotelBookingsPage.tsx) to feature a prominent live search UI with hotel result cards showing property name, star rating, location, price per night, and a booking/contact CTA. Use the existing mock hotel data generation logic as the data source with clearly marked placeholders for real RapidAPI Hotels credentials. The inquiry fallback form (submitting to backend with category 'hotel_booking') should remain available. Handle loading, empty, and error states gracefully.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "users should be able to book hotel's directly from our platform",
          "Hotels — Live search UI with property/rating/price cards; RapidAPI Hotels placeholders"
        ]
      },
      "acceptanceCriteria": [
        "The Hotel Bookings page displays a search form with destination, check-in date, check-out date, number of guests, number of rooms, and room type preference fields.",
        "After searching, hotel result cards are displayed showing property name, star rating, location, price per night, and a booking CTA.",
        "A 'Book Now' or equivalent CTA is present on each result card.",
        "An inquiry fallback form remains available and submits to the backend with category 'hotel_booking'.",
        "Loading, empty, and error states are handled with appropriate UI feedback.",
        "API credential placeholders are clearly marked with comments indicating where real RapidAPI Hotel credentials go.",
        "The page is responsive on mobile and desktop."
      ]
    }
  ],
  "constraints": [
    "Do not remove or alter existing inquiry form fallbacks on flight, railway, and hotel pages.",
    "All mock API services must have clearly marked comments indicating where real API credentials should be inserted.",
    "The business address 'Dhule, Maharashtra 424001' must appear in both the footer and the contact page — not just one location.",
    "No box shadows on the homepage starting interface.",
    "The 'Most Popular' badge must only appear on the SUV card, not the Sedan card.",
    "Do not edit files listed in frontend.immutablePaths.",
    "All pages must remain responsive on mobile and desktop."
  ],
  "nonGoals": [
    "Integrating real live API credentials for Amadeus, RapidAPI trains, or RapidAPI Hotels (placeholders only).",
    "IRCTC agent registration or any regulatory API partnership.",
    "Email or SMS notifications to the agency on form submission.",
    "Changes to the backend data model or Motoko actor (all required backend fields are already implemented).",
    "Changing the deployment slug or any deployment configuration.",
    "Altering the Terms & Conditions page content.",
    "Modifying immutable frontend paths (useInternetIdentity, useActor, main.tsx, ui components)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}