{
  "kind": "build_request",
  "title": "Update car rental per-km pricing and add Hotel & Hospitality Booking section",
  "projectName": "Blackrays Car Rentals & Tours",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-33",
      "text": "Update the Car Rentals page and all references to display the correct per-km pricing: Sedan at ₹13/km and SUV at ₹21/km. Update the fare estimator calculation logic to use these rates. Ensure the estimated fare displayed to the user and stored in the car rental inquiry submitted to the backend reflects these correct rates.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "For sedan it's 13 rupees km and for suv it's 21 rupees km"
        ]
      },
      "acceptanceCriteria": [
        "Car Rentals page displays 'Sedan ₹13/km' and 'SUV ₹21/km' prominently.",
        "Entering an estimated distance in km calculates and displays the fare using ₹13/km for Sedan and ₹21/km for SUV.",
        "The calculated estimated fare stored in the backend inquiry reflects the correct per-km rates.",
        "HomePage pricing section (if present) is updated to show ₹13/km for Sedan and ₹21/km for SUV."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Add a new public Hotel & Hospitality Bookings page accessible from the main navigation and from the homepage. The page should describe Blackrays' hotel booking assistance service covering properties across India and internationally. Include a hotel search/inquiry form capturing: destination city/location, check-in date, check-out date, number of guests, number of rooms, and room type preference (Standard / Deluxe / Suite). Integrate a real-time hotel search API (e.g., RapidAPI Hotels or a compatible aggregator) to display live hotel results with property name, star rating, location, price per night, and a booking/contact CTA. Handle loading, empty, and error states gracefully. On form submission (for inquiry fallback), store the request as an inquiry in the backend with category 'hotel_booking'.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add hotel and hospitality booking section as well with real time booking api of all hotel partners in India and internationally"
        ]
      },
      "acceptanceCriteria": [
        "A '/hotels' route exists and renders the Hotel & Hospitality Bookings page.",
        "The page is linked from the main navigation header (Bookings dropdown or top-level link) and from the homepage service cards section.",
        "The search form captures: destination, check-in date, check-out date, number of guests, number of rooms, and room type preference.",
        "Live hotel search results are displayed in a clean card list showing property name, star rating, location, price per night, and a booking CTA.",
        "Loading, empty, and error states are handled with appropriate UI feedback.",
        "Submitting an inquiry (fallback) stores a backend record with category 'hotel_booking' and all relevant form fields.",
        "The admin inquiries page displays hotel_booking inquiries with their relevant fields.",
        "The page is visually consistent with the premium black/white/grey palette."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Extend the backend inquiry data model to support a 'hotel_booking' category. Add optional fields: hotelDestination (Text), checkInDate (Text), checkOutDate (Text), numberOfGuests (Nat), numberOfRooms (Nat), and roomTypePreference (Text). Ensure existing inquiry categories and fields remain unaffected. Update the admin inquiries listing to display these fields when the category is 'hotel_booking'.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add hotel and hospitality booking section as well with real time booking api of all hotel partners in India and internationally"
        ]
      },
      "acceptanceCriteria": [
        "The Motoko inquiry type includes optional hotel_booking fields: hotelDestination, checkInDate, checkOutDate, numberOfGuests, numberOfRooms, roomTypePreference.",
        "A new 'hotel_booking' variant exists in the inquiry category type.",
        "submitInquiry (or equivalent API) accepts hotel_booking category with the new fields.",
        "All existing inquiry categories (tour_inquiry, car_rental, custom_package, railway_booking, flight_booking) continue to work without regression.",
        "Admin inquiries page shows hotel-specific fields for hotel_booking inquiries."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Update the homepage service cards/section to include a Hotel & Hospitality Bookings card with a brief description (e.g., 'Find and book premium hotels across India and internationally') and a CTA button linking to the '/hotels' page. Ensure the layout remains visually consistent with the existing premium black/white/grey aesthetic.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add hotel and hospitality booking section as well with real time booking api of all hotel partners in India and internationally"
        ]
      },
      "acceptanceCriteria": [
        "The homepage service section includes a Hotel & Hospitality card alongside existing service cards.",
        "The card shows a relevant icon, brief description, and a CTA button linking to '/hotels'.",
        "The homepage layout remains consistent and responsive on mobile and desktop."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Add a 'Hotels' tab to the homepage hero search widget (HeroSearchWidget) alongside the existing Flights, Trains, Car Rentals, and Tour Packages tabs. The Hotels tab should show quick-search inputs for destination city, check-in date, and check-out date. Submitting the form should navigate to the '/hotels' page with pre-filled search parameters where applicable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add hotel and hospitality booking section as well with real time booking api of all hotel partners in India and internationally"
        ]
      },
      "acceptanceCriteria": [
        "The hero search widget includes a 'Hotels' tab.",
        "The Hotels tab shows inputs for destination, check-in date, and check-out date.",
        "Submitting navigates to '/hotels' and pre-fills search parameters in the Hotel page's search form.",
        "The widget remains visually consistent and responsive."
      ]
    }
  ],
  "constraints": [
    "Do not alter immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "All Motoko logic must remain in the single backend/main.mo actor.",
    "Do not change any existing inquiry categories or their fields.",
    "Real-time hotel API integration should degrade gracefully to inquiry fallback if API credentials are unavailable.",
    "Deployment slug must remain 'blackrays-car-rentals-tours' as currently configured."
  ],
  "nonGoals": [
    "Adding outbound email or SMS notifications.",
    "Building a hotel property management or CMS system.",
    "Implementing user-facing hotel loyalty programs or payment processing.",
    "Changing the existing flight or railway booking pages.",
    "Modifying the existing daily rate (₹2500/day Sedan, ₹5000/day SUV) if it is still displayed elsewhere for reference."
  ],
  "imageRequirements": {
    "required": [
      "Premium hotel lobby or luxury hotel exterior at night with warm accent lighting, dark moody atmosphere, elegant and high-end feel consistent with black/white/grey premium palette (hotel-hero-premium.dim_1200x600.png)"
    ],
    "edits": []
  }
}