{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Car Rentals: Dual Pricing (Per-km & Per-day), With/Without Driver, Most Popular Badge, T&C Integration",
  "requirements": [
    {
      "id": "REQ-38",
      "summary": "Display dual pricing modes (per-km and per-day) for Sedan and SUV vehicles with 'Most Popular' badge on Sedan card",
      "acceptanceCriteria": [
        "Sedan card displays ₹13/km and ₹2,500/day as two distinct pricing options",
        "SUV card displays ₹21/km and ₹5,000/day as two distinct pricing options",
        "Sedan card is visually highlighted with a 'Most Popular' badge",
        "Both vehicle types show 'With Driver' and 'Without Driver' options",
        "Pricing mode selection (per-km vs per-day) is clearly interactive and visually distinct"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CarRentalsPage.tsx",
          "operation": "modify",
          "description": "Update vehicle card UI to display both pricing modes (per-km and per-day) for Sedan (₹13/km, ₹2,500/day) and SUV (₹21/km, ₹5,000/day). Add a visual 'Most Popular' badge to the Sedan card. Ensure both 'With Driver' and 'Without Driver' options are clearly presented. Add interactive pricing mode toggle (radio buttons or segmented control) that allows users to select between per-km and per-day pricing. Use clean borders and subtle background contrasts for visual hierarchy without box shadows, consistent with the premium black/white/grey aesthetic."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Implement dynamic fare estimator supporting per-km and per-day pricing modes with live calculation",
      "acceptanceCriteria": [
        "Per-km mode: inputting distance calculates and displays estimated fare using the correct rate (₹13/km for Sedan, ₹21/km for SUV)",
        "Per-day mode: inputting number of days calculates and displays estimated fare using the correct rate (₹2,500/day for Sedan, ₹5,000/day for SUV)",
        "Estimated fare updates dynamically as the user types",
        "Selected pricing mode, input value (distance or days), and estimated fare are submitted with the inquiry to the backend",
        "Backend stores the pricing mode, distance/days, and estimated fare in the car rental inquiry record"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CarRentalsPage.tsx",
          "operation": "modify",
          "description": "Add fare estimator section that switches between distance input (for per-km mode) and days input (for per-day mode) based on selected pricing mode. Implement live calculation logic: for per-km mode, multiply distance by vehicle rate (₹13/km Sedan, ₹21/km SUV); for per-day mode, multiply days by vehicle rate (₹2,500/day Sedan, ₹5,000/day SUV). Display the calculated estimated fare prominently, updating dynamically as the user types. When submitting the inquiry, pass the selected pricingMode (CarRentalPricingMode enum: perKm or perDay), estimatedDistance (bigint | null), estimatedDays (bigint | null), and computed estimatedFare (bigint) to the submitCarRental backend method. Ensure proper form state management and validation for the dynamic input field."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the useSubmitCarRental mutation hook to accept and pass the new parameters: pricingMode (CarRentalPricingMode), estimatedDistance (bigint | null), estimatedDays (bigint | null), and estimatedFare (bigint). Ensure the mutation calls actor.submitCarRental with all required arguments matching the backend interface signature. Add appropriate error handling and success feedback."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Integrate T&C acknowledgment checkbox with liability notice for car rental booking form",
      "acceptanceCriteria": [
        "A T&C acknowledgment checkbox is visible on the Car Rentals booking form",
        "The checkbox label or adjacent text states: 'Without driver — if anything happens to the vehicle, the consumer is fully liable for all repair and associated costs'",
        "The checkbox includes or is adjacent to a link to the Terms & Conditions page",
        "The form submit button is disabled or shows a validation error if the checkbox is not checked",
        "The T&C page remains accessible from the footer"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CarRentalsPage.tsx",
          "operation": "modify",
          "description": "Add a T&C acknowledgment checkbox to the car rental booking form. Display the required liability notice text: 'Without driver — if anything happens to the vehicle, the consumer is fully liable for all repair and associated costs.' Include a clickable link to the Terms & Conditions page (/terms) within or adjacent to the checkbox label. Add form validation to prevent submission unless the checkbox is checked. Disable the submit button or show a validation error message when the checkbox is unchecked. Use consistent styling with the premium design system (borders, no box shadows)."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Refresh Car Rentals page UI for premium user experience with clean borders, improved typography, and responsive layout",
      "acceptanceCriteria": [
        "Car Rentals page has no box shadows; depth is conveyed via borders and background contrasts",
        "Vehicle cards have a clear, polished layout with readable typography hierarchy",
        "Pricing mode toggle (per-km / per-day), driver option (with/without), and fare estimator inputs are visually grouped and easy to follow",
        "Page is fully responsive on mobile and desktop",
        "Visual style is consistent with the overall black/white/grey premium palette used across the site"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CarRentalsPage.tsx",
          "operation": "modify",
          "description": "Refresh the entire Car Rentals page UI to align with the premium black/white/grey aesthetic matching MakeMyTrip/Uber style. Remove all box shadows; use clean borders (1px or 2px solid) and subtle background contrasts (light grey vs white, dark grey borders) to convey depth and card separation. Improve typography hierarchy: use larger, bold headings for vehicle types and pricing, clear labels for all inputs, and readable body text for descriptions and notices. Group related controls visually: vehicle selection cards, pricing mode toggle, driver option toggle, and fare estimator inputs should be clearly organized in logical sections with appropriate spacing. Ensure full responsiveness: vehicle cards stack vertically on mobile, form fields adjust width appropriately, and all interactive elements remain accessible on touch devices. Apply consistent spacing, padding, and color tokens from the global Tailwind config and index.css. Verify the page layout integrates seamlessly with the existing SiteLayout (Header + Footer)."
        }
      ]
    }
  ]
}