{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update car rental pricing and add Hotel & Hospitality Booking section",
  "requirements": [
    {
      "id": "REQ-33",
      "summary": "Update car rental per-km pricing to ₹13/km for Sedan and ₹21/km for SUV across all frontend displays and fare calculations",
      "acceptanceCriteria": [
        "Car Rentals page displays 'Sedan ₹13/km' and 'SUV ₹21/km' prominently.",
        "Entering an estimated distance in km calculates and displays the fare using ₹13/km for Sedan and ₹21/km for SUV.",
        "The calculated estimated fare stored in the backend inquiry reflects the correct per-km rates.",
        "HomePage pricing section (if present) is updated to show ₹13/km for Sedan and ₹21/km for SUV."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CarRentalsPage.tsx",
          "operation": "modify",
          "description": "Update the per-km pricing constants to SEDAN_RATE_PER_KM = 13 and SUV_RATE_PER_KM = 21. Update the pricing display text to show '₹13/km' for Sedan and '₹21/km' for SUV. Ensure the fare calculation logic (estimatedFare = distance * rate) uses these new rates and the calculated fare is passed to the submitCarRental mutation."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Locate the car pricing section (likely in the service cards or features area) and update any displayed per-km rates to show 'Sedan ₹13/km' and 'SUV ₹21/km'. If daily rates (₹2500/₹5000) are also shown, leave them unchanged as they are not in scope for this requirement."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Create a new Hotel & Hospitality Bookings page with live hotel search API integration and inquiry fallback",
      "acceptanceCriteria": [
        "A '/hotels' route exists and renders the Hotel & Hospitality Bookings page.",
        "The page is linked from the main navigation header (Bookings dropdown or top-level link) and from the homepage service cards section.",
        "The search form captures: destination, check-in date, check-out date, number of guests, number of rooms, and room type preference.",
        "Live hotel search results are displayed in a clean card list showing property name, star rating, location, price per night, and a booking CTA.",
        "Loading, empty, and error states are handled with appropriate UI feedback.",
        "Submitting an inquiry (fallback) stores a backend record with category 'hotel_booking' and all relevant form fields.",
        "The admin inquiries page displays hotel_booking inquiries with their relevant fields.",
        "The page is visually consistent with the premium black/white/grey palette."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HotelBookingsPage.tsx",
          "operation": "create",
          "description": "Create a new Hotel & Hospitality Bookings page featuring a hero section with the generated hotel hero image at frontend/public/assets/generated/hotel-hero-premium.dim_1200x600.png. Include a search form with fields: destination (text input), checkInDate (date picker), checkOutDate (date picker), numberOfGuests (number input), numberOfRooms (number input), and roomTypePreference (select: Standard/Deluxe/Suite). Wire the form to trigger a hotel search via useHotelSearch hook. Display live search results in a card list using HotelResultCard components. Include a collapsible manual inquiry form that calls useSubmitHotelBooking mutation with all form fields plus optional hotelName, starRating, location, and pricePerNight. Handle loading, empty, and error states with appropriate UI feedback. Verify the component's usage instructions for the http-outcalls component before implementing the live search API integration."
        },
        {
          "path": "frontend/src/hooks/useHotelSearch.ts",
          "operation": "create",
          "description": "Create a custom React hook that manages hotel search state using React Query. Define HotelSearchParams interface (destination, checkInDate, checkOutDate, numberOfGuests, numberOfRooms, roomTypePreference) and HotelResult interface (hotelName, starRating, location, pricePerNight, bookingUrl). Expose searchHotels and resetSearch functions. Integrate with a hotel search API service (defined in frontend/src/services/hotelApi.ts) using a 5-minute stale time similar to useFlightSearch. Handle API errors gracefully and return empty results on failure to allow fallback to inquiry form."
        },
        {
          "path": "frontend/src/services/hotelApi.ts",
          "operation": "create",
          "description": "Create a hotel search API service that defines TypeScript interfaces for HotelSearchParams and HotelResult. Implement searchHotels function that makes HTTP requests to a hotel aggregator API (e.g., RapidAPI Hotels or Booking.com API). Include mock data generation as a fallback if API credentials are unavailable. The service should return an array of hotel results with property name, star rating, location, price per night, and booking URL. Include error handling and timeout logic. Note: The actual API integration will use the http-outcalls component for backend-mediated requests if required for CORS or API key security."
        },
        {
          "path": "frontend/src/components/hotels/HotelSearchForm.tsx",
          "operation": "create",
          "description": "Create a reusable hotel search form component with validated inputs for destination, checkInDate, checkOutDate, numberOfGuests, numberOfRooms, and roomTypePreference (dropdown: Standard/Deluxe/Suite). Include client-side validation (check-out after check-in, positive guest/room counts). On submit, invoke the onSearch callback with HotelSearchParams. Style consistently with FlightSearchForm and RailwaySearchForm using the premium black/white/grey palette and Tailwind utilities."
        },
        {
          "path": "frontend/src/components/hotels/HotelResultCard.tsx",
          "operation": "create",
          "description": "Create a card component to display a single hotel search result. Show hotel name (heading), star rating (icon display), location (subtext), price per night (prominent), and a booking CTA button. If bookingUrl is present, open it in a new tab; otherwise trigger an onBook callback to pre-fill the inquiry form. Style consistently with FlightResultCard and RailwayResultCard using card shadows, rounded corners, and hover effects."
        },
        {
          "path": "frontend/src/components/hotels/HotelResultsList.tsx",
          "operation": "create",
          "description": "Create a component that renders a list of HotelResultCard components. Accept props for results array, loading state, error message, and onBook callback. Display loading spinner when searching, error alert on failure, empty state message when no results, and a grid of hotel cards when results are available. Follow the pattern used in FlightResultsList and RailwayResultsList."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new mutation hook useSubmitHotelBooking that calls actor.submitHotelBooking with parameters: name, phoneNumber, email, destination, checkInDate, checkOutDate, numberOfGuests, numberOfRooms, roomTypePreference, and optional hotelName, starRating, location, pricePerNight (all as bigint or string per backend interface). Invalidate the 'inquiries' query key on success. Include error handling with toast notifications."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new public route '/hotels' that renders HotelBookingsPage component. Place it alongside other booking routes (flights, railway, car-rentals) in the router configuration."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Add a Hotel & Hospitality Bookings service card to the homepage service section",
      "acceptanceCriteria": [
        "The homepage service section includes a Hotel & Hospitality card alongside existing service cards.",
        "The card shows a relevant icon, brief description, and a CTA button linking to '/hotels'.",
        "The homepage layout remains consistent and responsive on mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add a new service card in the services section for 'Hotel & Hospitality Bookings'. Use a hotel/bed icon from lucide-react (e.g., Hotel or Bed). Include a brief description: 'Find and book premium hotels across India and internationally'. Add a CTA button linking to '/hotels'. Ensure the card matches the styling and layout of existing service cards (Packages, Car Rentals, Flights, Railway) and remains responsive on mobile and desktop."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Add a Hotels tab to the homepage hero search widget",
      "acceptanceCriteria": [
        "The hero search widget includes a 'Hotels' tab.",
        "The Hotels tab shows inputs for destination, check-in date, and check-out date.",
        "Submitting navigates to '/hotels' and pre-fills search parameters in the Hotel page's search form.",
        "The widget remains visually consistent and responsive."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/home/HeroSearchWidget.tsx",
          "operation": "modify",
          "description": "Add a new 'Hotels' tab to the existing tabbed widget alongside Flights, Trains, Car Rentals, and Tour Packages. In the Hotels tab content, include three input fields: destination (text input), checkInDate (date picker), and checkOutDate (date picker). On form submit, navigate to '/hotels' with query parameters (e.g., ?destination=...&checkIn=...&checkOut=...) using the router navigation hook. Ensure the tab and inputs match the styling and layout of existing tabs. Keep the widget responsive and visually consistent with the premium black/white/grey palette."
        },
        {
          "path": "frontend/src/pages/HotelBookingsPage.tsx",
          "operation": "modify",
          "description": "Add logic to HotelBookingsPage to read URL query parameters on mount (using frontend/src/utils/urlParams.ts utility functions). If destination, checkIn, and checkOut params are present, pre-fill the search form fields and auto-trigger a hotel search. This enables seamless navigation from the hero widget with pre-populated search criteria."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Update Header navigation to include Hotels link",
      "acceptanceCriteria": [
        "The page is linked from the main navigation header (Bookings dropdown or top-level link) and from the homepage service cards section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Add a 'Hotels' link to the Bookings dropdown menu in the desktop navigation. The link should navigate to '/hotels'. Ensure the mobile hamburger menu also includes the Hotels link under the Bookings section. Keep the navigation styling consistent with existing links."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Update admin inquiries page to display hotel_booking inquiry details",
      "acceptanceCriteria": [
        "The admin inquiries page displays hotel_booking inquiries with their relevant fields."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminInquiriesPage.tsx",
          "operation": "modify",
          "description": "Add a conditional rendering block for inquiries with category 'hotelBooking'. Display hotel-specific fields from inquiry.hotelBookingDetails: destination, checkInDate, checkOutDate, numberOfGuests, numberOfRooms, roomTypePreference, and optional hotelName, starRating, location, pricePerNight. Format the display similarly to existing category-specific details (carRental, flightBooking, railwayBooking). Ensure the layout remains clean and the fields are labeled clearly."
        }
      ]
    }
  ]
}