{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Move SUV 'Most Popular' badge, add business address, premium homepage redesign, and direct booking UI for flights/trains/hotels",
  "requirements": [
    {
      "id": "REQ-42",
      "summary": "Move the 'Most Popular' badge from the Sedan vehicle card to the SUV vehicle card on the Car Rentals page",
      "acceptanceCriteria": [
        "The SUV vehicle card displays a 'Most Popular' badge prominently.",
        "The Sedan vehicle card does not display a 'Most Popular' badge.",
        "All other vehicle card content (pricing, description, features) remains unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CarRentalsPage.tsx",
          "operation": "modify",
          "description": "Update the vehicle card rendering logic to display the 'Most Popular' badge on the SUV card instead of the Sedan card. Remove any badge display logic from the Sedan card section and add/move the badge markup to the SUV card section. Ensure the badge styling and positioning remain consistent with the existing premium design."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Add the business address 'Dhule, Maharashtra 424001' to the site footer and Contact/Inquiry page",
      "acceptanceCriteria": [
        "The footer displays 'Dhule, Maharashtra 424001' as the business address.",
        "The Contact/Inquiry page displays 'Dhule, Maharashtra 424001' in the contact info section.",
        "The address appears consistently formatted alongside the phone, email, and MD & Chairman details."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Add the business address 'Dhule, Maharashtra 424001' to the footer's contact details section alongside the existing phone and email information. Use consistent formatting and styling with the existing contact elements. Include an appropriate icon (e.g., map pin or location icon) for visual consistency."
        },
        {
          "path": "frontend/src/pages/ContactInquiryPage.tsx",
          "operation": "modify",
          "description": "Add a contact info card displaying the business address 'Dhule, Maharashtra 424001' in the static contact information section alongside the existing phone and email cards. Ensure the card styling and layout match the existing contact cards and use an appropriate location icon."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Overhaul the homepage starting interface with a more unique, premium, and user-friendly visual design featuring refreshed hero treatment, improved typography, richer visual hierarchy, and polished micro-details",
      "acceptanceCriteria": [
        "The homepage hero section has a visually distinct, premium look that differs meaningfully from the previous version.",
        "The HeroSearchWidget includes tabs for Flights, Trains, Hotels, Car Rentals, and Tour Packages.",
        "No box shadows are present on any element in the initial viewport.",
        "Service cards for all offerings (Flights, Trains, Car Rentals, Hotels, Custom Packages, Tour Packages, Railway Bookings) are displayed with clear descriptions and CTA buttons.",
        "The layout is fully responsive on mobile and desktop.",
        "The design remains consistent with the black/white/grey/beige premium palette."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Completely redesign the hero section with a more premium, unique visual treatment featuring improved typography hierarchy, refined layout flow, and polished micro-details. Update the service cards section to display all seven offerings (Flights, Trains, Car Rentals, Hotels, Custom Packages, Tour Packages, Railway Bookings) with clear descriptions and prominent CTA buttons linking to their respective pages. Remove all box-shadow CSS from elements in the initial viewport. Ensure the HeroSearchWidget is prominently integrated. Maintain consistency with the existing black/white/grey/beige premium palette and ensure full mobile/desktop responsiveness."
        },
        {
          "path": "frontend/src/components/home/HeroSearchWidget.tsx",
          "operation": "modify",
          "description": "Ensure the search widget includes all five tabs (Flights, Trains, Hotels, Car Rentals, Tour Packages) with updated premium styling that removes box shadows and improves visual hierarchy. Refine typography, spacing, and tab interactions for a more polished, user-friendly experience. Verify each tab navigates correctly to its corresponding booking page with appropriate search parameters."
        },
        {
          "path": "frontend/src/components/home/HomeContactBar.tsx",
          "operation": "modify",
          "description": "Refresh the contact bar styling to align with the new premium homepage design. Remove any box shadows, improve typography hierarchy, and refine spacing for a more polished appearance while maintaining the existing contact information display (MD & Chairman, phone, email)."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global CSS custom properties and utility classes to support the premium homepage redesign. Refine typography scale, spacing utilities, and premium design tokens while ensuring consistency with the black/white/grey/beige palette. Add or update utility classes for shadow-free premium UI elements as needed for the hero section and service cards."
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Rebuild the Flight Ticket Bookings page with a prominent live search UI featuring flight result cards with airline, times, duration, stops, cabin class, and fare, using mock API with Amadeus credential placeholders",
      "acceptanceCriteria": [
        "The Flight Bookings page displays a search form with origin, destination, date, passengers, and cabin class fields.",
        "After searching, flight result cards are displayed showing airline, departure/arrival times, duration, stops, and price.",
        "A 'Book Now' or equivalent CTA is present on each result card.",
        "Loading, empty, and error states are handled with appropriate UI feedback.",
        "API credential placeholders are clearly marked in the service file with comments indicating where real Amadeus credentials go.",
        "The page is responsive on mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FlightBookingsPage.tsx",
          "operation": "modify",
          "description": "Rebuild the page to feature a prominent live search UI that auto-triggers search from URL params and displays results in a clean card list below the search form. Ensure the FlightSearchForm, FlightResultsList, and inquiry fallback form are all properly integrated. Add clear section headings and improve the overall layout hierarchy for a premium, user-friendly experience. Maintain responsive design for mobile and desktop. Keep the existing inquiry form fallback available below the results section."
        },
        {
          "path": "frontend/src/components/flights/FlightSearchForm.tsx",
          "operation": "modify",
          "description": "Enhance the search form UI with improved visual hierarchy, premium styling consistent with the homepage redesign, and polished micro-details. Ensure all required fields (origin, destination, date, passengers, cabin class) are present with proper validation. Remove box shadows and refine spacing/typography for a more premium appearance."
        },
        {
          "path": "frontend/src/components/flights/FlightResultsList.tsx",
          "operation": "modify",
          "description": "Refine the results list component to display flight result cards with improved premium styling, better loading/error/empty states, and enhanced visual feedback. Ensure clear messaging for each state and maintain responsive grid/list layout."
        },
        {
          "path": "frontend/src/components/flights/FlightResultCard.tsx",
          "operation": "modify",
          "description": "Enhance the flight result card design with premium styling, improved typography hierarchy, and polished micro-details. Ensure all required information (airline, departure/arrival times, duration, stops, cabin class, fare) is clearly displayed. Add a prominent 'Book Now' CTA button that links to the inquiry form or opens it in context. Remove box shadows and apply consistent styling with the overall premium design."
        },
        {
          "path": "frontend/src/services/flightApi.ts",
          "operation": "modify",
          "description": "Add clearly marked comment placeholders at the top of the file indicating where real Amadeus API credentials and endpoint URLs should be inserted. Include comments explaining the expected credential format (API key, API secret, base URL) and integration steps. Ensure the mock data generation logic remains functional until real API integration. Add a comment block explaining that the current mock implementation should be replaced with actual Amadeus API calls once credentials are available."
        }
      ]
    },
    {
      "id": "REQ-46",
      "summary": "Rebuild the Railway Ticket Bookings page with a prominent live search UI featuring train result cards with train name/number, times, duration, available classes with fares, using mock API with RapidAPI/IRCTC credential placeholders",
      "acceptanceCriteria": [
        "The Railway Bookings page displays a search form with origin station, destination station, date, class, and passenger count fields.",
        "After searching, train result cards are displayed showing train name/number, departure/arrival times, duration, available classes, and fares.",
        "A 'Book Now' or equivalent CTA is present on each result card.",
        "Loading, empty, and error states are handled with appropriate UI feedback.",
        "API credential placeholders are clearly marked in the service file with comments indicating where real RapidAPI/IRCTC credentials go.",
        "The page is responsive on mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RailwayBookingsPage.tsx",
          "operation": "modify",
          "description": "Rebuild the page to feature a prominent live search UI that displays train search results in a clean card list below the search form. Integrate the RailwaySearchForm and RailwayResultsList components with improved layout hierarchy and premium styling. Ensure the inquiry form fallback remains available below the results section. Maintain responsive design and improve overall visual hierarchy for a user-friendly experience."
        },
        {
          "path": "frontend/src/components/railway/RailwaySearchForm.tsx",
          "operation": "modify",
          "description": "Enhance the railway search form UI with premium styling consistent with the redesigned flight search form. Ensure all required fields (origin station, destination station, date, rail class, passenger count) are present with proper validation. Improve typography hierarchy, remove box shadows, and refine spacing for a polished appearance."
        },
        {
          "path": "frontend/src/components/railway/RailwayResultsList.tsx",
          "operation": "modify",
          "description": "Refine the train results list component with improved premium styling, better loading/error/empty state messaging, and enhanced visual feedback. Ensure responsive grid/list layout and clear state indicators for each scenario."
        },
        {
          "path": "frontend/src/components/railway/RailwayResultCard.tsx",
          "operation": "modify",
          "description": "Enhance the train result card design with premium styling, improved typography hierarchy, and polished micro-details. Ensure all required information (train name/number, departure/arrival times, duration, available classes with fares) is clearly displayed. Add a prominent 'Book Now' CTA button that links to the inquiry form or opens it in context. Remove box shadows and apply consistent styling with the overall premium design."
        },
        {
          "path": "frontend/src/services/railwayApi.ts",
          "operation": "modify",
          "description": "Add clearly marked comment placeholders at the top of the file indicating where real RapidAPI or IRCTC API credentials and endpoint URLs should be inserted. Include comments explaining the expected credential format (API key, host, base URL) and integration steps. Ensure the mock data generation logic remains functional until real API integration. Add a comment block explaining that the current mock implementation should be replaced with actual RapidAPI/IRCTC API calls once credentials are available."
        }
      ]
    },
    {
      "id": "REQ-47",
      "summary": "Rebuild the Hotel & Hospitality Bookings page with a prominent live search UI featuring hotel result cards with property name, star rating, location, price per night, and booking CTA, using mock data with RapidAPI Hotels credential placeholders",
      "acceptanceCriteria": [
        "The Hotel Bookings page displays a search form with destination, check-in date, check-out date, number of guests, number of rooms, and room type preference fields.",
        "After searching, hotel result cards are displayed showing property name, star rating, location, price per night, and a booking CTA.",
        "A 'Book Now' or equivalent CTA is present on each result card.",
        "An inquiry fallback form remains available and submits to the backend with category 'hotel_booking'.",
        "Loading, empty, and error states are handled with appropriate UI feedback.",
        "API credential placeholders are clearly marked with comments indicating where real RapidAPI Hotel credentials go.",
        "The page is responsive on mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HotelBookingsPage.tsx",
          "operation": "modify",
          "description": "Rebuild the page to feature a prominent live search UI that generates and displays mock hotel results in a clean card list below the search form. Create a new search form component (inline or extracted) with fields for destination, check-in/check-out dates, number of guests, number of rooms, and room type preference. Display hotel result cards showing property name, star rating, location, and price per night with a 'Book Now' CTA. Ensure the inquiry fallback form remains available below the results section and submits with category 'hotel_booking'. Add loading, empty, and error states. Maintain responsive design and premium styling consistent with the flight and railway pages."
        },
        {
          "path": "frontend/src/services/hotelApi.ts",
          "operation": "create",
          "description": "Create a new service file for hotel search functionality. Define TypeScript interfaces for hotel search parameters (destination, check-in/check-out dates, guests, rooms, room type) and hotel result types (property name, star rating, location, price per night, amenities). Implement a mock data generator function that returns sample hotel results based on search parameters. Add clearly marked comment placeholders at the top of the file indicating where real RapidAPI Hotels credentials and endpoint URLs should be inserted, including expected credential format (API key, host, base URL) and integration steps. Include a comment block explaining that the mock implementation should be replaced with actual RapidAPI Hotels API calls once credentials are available."
        },
        {
          "path": "frontend/src/hooks/useHotelSearch.ts",
          "operation": "create",
          "description": "Create a custom React hook similar to useFlightSearch and useRailwaySearch that manages hotel search state and triggers a React Query fetch via the new hotel API service. Export search parameters state, results, loading/error states, and search/reset functions. Integrate with the mock hotel API service created in hotelApi.ts."
        }
      ]
    }
  ]
}