{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, tour packages, and submission of tour and car‑rental inquiries with admin‑restricted management APIs.",
  "feature_evidence.json": "Feature evidence report mapping deployment‑related requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of many frontend files for reference or documentation.",
  "frontend/DEPLOYMENT.md": "Markdown describing the valid deployment slug and rules for platform‑managed deployment.",
  "frontend/index.css": "Tailwind base layer defining global OKLCH color variables and dark‑mode tokens.",
  "frontend/index.html": "HTML entry point mounting the root element and loading the main client script.",
  "frontend/public/_redirects": "Static hosting redirect file routing all paths to index.html for SPA fallback.",
  "frontend/public/404.html": "Custom 404 page loading the bundled SPA assets for client‑side routing.",
  "frontend/src/App.tsx": "Root React app configuring TanStack Router routes, layout, and theme provider.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Component that restricts admin routes based on Internet Identity authentication and admin permission.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling Internet Identity login/logout with loading states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting authenticated users without profiles to enter and save their name.",
  "frontend/src/components/home/HomeContactBar.tsx": "Renders a contact bar displaying phone, email, and MD details using icons and styled card layout.",
  "frontend/src/components/layout/Footer.tsx": "Provides a site footer with about text, quick links, social icons, contact info, and dynamic copyright.",
  "frontend/src/components/layout/Header.tsx": "Implements a responsive header with navigation links, logo, mobile menu, and conditional admin/login elements.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout wrapping header, outlet content, and footer.",
  "frontend/src/components/packages/PackageCard.tsx": "Displays a tour package card with title, description, duration, price, and link to details.",
  "frontend/src/config/deployment.ts": "Exports and validates a deployment slug ensuring platform rules and inclusion of 'blackrays'.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and client initialization.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating packages, inquiries, and admin actions using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers and custom theme variables for light and dark modes, plus global styles and a hero overlay component.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company intro, mission statement, and values displayed using cards and icons.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing quick links to manage packages and inquiries, displaying a welcome message.",
  "frontend/src/pages/admin/AdminInquiriesPage.tsx": "Admin interface for viewing inquiries, updating their status, and handling loading or error states.",
  "frontend/src/pages/admin/AdminPackagesPage.tsx": "Admin CRUD page for creating, editing, and deleting tour packages with dialogs and form handling.",
  "frontend/src/pages/CarRentalsPage.tsx": "Implements a car rental booking form with validation, submission handling, and success/error alerts.",
  "frontend/src/pages/ContactInquiryPage.tsx": "Provides a contact inquiry form that submits user messages and displays corresponding success or error states.",
  "frontend/src/pages/HomePage.tsx": "Builds the landing page with a hero section, contact bar, and quick car rental info cards.",
  "frontend/src/pages/PackageDetailsPage.tsx": "Loads and displays detailed information for a selected travel package with error, loading, and not-found states.",
  "frontend/src/pages/PackagesPage.tsx": "Public packages page that fetches and displays tour packages with loading, error, and empty states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session storage parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and container settings.",
  "project_state.json": "Describes the project’s current state, including goals, scalability notes, domain and notification issues, and a list of existing frontend, admin, and UX-related features. Serves as the master record for requirements and known constraints."
}