{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Deploy/publish configuration verification (slug + SPA routing fallback)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the platform-managed deployment slug remains exactly \"blackrays-car-rentals-tours\" as configured.",
      "acceptanceCriteria": [
        "frontend/src/config/deployment.ts exports DEPLOYMENT_SLUG set to \"blackrays-car-rentals-tours\".",
        "Slug validation continues to enforce platform constraints (lowercase letters, numbers, hyphens; includes \"blackrays\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/deployment.ts",
          "operation": "modify",
          "description": "Verify and, if needed, reinforce that DEPLOYMENT_SLUG is exactly \"blackrays-car-rentals-tours\" and that module-load validation continues to guard invalid slugs."
        },
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Update/complete the documentation section that states where the platform-managed slug is configured (ensure it clearly references frontend/src/config/deployment.ts)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Prevent usage of the invalid deployment slug \"blackrays-car-rentals-&-tours-and-travels\".",
      "acceptanceCriteria": [
        "No build-time or runtime configuration references the invalid slug containing \"&\".",
        "Documentation explicitly marks the invalid slug as not allowed and does not instruct using it anywhere."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/deployment.ts",
          "operation": "modify",
          "description": "Add/adjust defensive checks and comments to ensure invalid characters (including \"&\") are rejected by validation and the configured slug cannot drift to the invalid value."
        },
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Ensure the invalid slug is documented only in the 'Invalid Slugs' section and that the valid slug is the only one presented for deployment."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Keep SPA routing fallback intact so all paths route to /index.html for client-side routing.",
      "acceptanceCriteria": [
        "frontend/public/_redirects continues to route all paths to /index.html with a 200 status.",
        "No changes break client-side routing for deep links (e.g., /packages/123)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/_redirects",
          "operation": "modify",
          "description": "Verify the SPA fallback rule remains '/*    /index.html   200' and normalize formatting only if necessary without changing behavior."
        },
        {
          "path": "frontend/public/404.html",
          "operation": "modify",
          "description": "Verify the 404 fallback page continues to load the SPA assets for client-side routing; make only minimal adjustments if required for consistency with current build output."
        }
      ]
    }
  ]
}